; <Hungarian>
; <Zityi's Translator Team>

[Hungarian]
IDS_TITLE_EXCLUDE=Exclude
IDS_FILE=Fájl
IDS_SETTINGS=Beállítások
IDS_EXIT=Kilépés
IDS_EDIT=Szerkesztés
IDS_PURGE_UNUSED=Purge unused apps
IDS_PURGE_TIMERS=Purge timers
IDS_FIND=Search
IDS_REFRESH=Frissítés
IDS_VIEW=Nézet
IDS_ICONS=Ikonok
IDS_ICONSSMALL=Kicsi
IDS_ICONSLARGE=Nagy
IDS_ICONSISHIDDEN=Ikonok elrejtése
IDS_LANGUAGE=Nyelv
IDS_FONT=Betűtípus
IDS_HELP=Súgó
IDS_WEBSITE=Weboldal
IDS_CHECKUPDATES=Frissítések ellenőrzése
IDS_DONATE=Give thanks!
IDS_ABOUT=Névjegy
IDS_TRAY_SHOW=Megjelenítés/elrejtés
IDS_TRAY_START=Enable filters
IDS_TRAY_STOP=Disable filters
IDS_TRAY_RULES=Rules
IDS_TRAY_BLOCKLIST_RULES=Tiltólista
IDS_TRAY_SYSTEM_RULES=Rendszerszabályok
IDS_TRAY_USER_RULES=Custom rules
IDS_TRAY_LOGERR=Hibák naplózása
IDS_ADD_FILE=Fájl hozzáadása
IDS_ANY=Mind
IDS_DISABLENOTIFICATIONS=Értesítések letiltása
IDS_OPENRULESEDITOR=Szabály létrehozása
IDS_TIMER=Timer
IDS_DISABLETIMER=Disable timer
IDS_EXPLORE=Tartalmazó mappa megnyitása
IDS_COPY=Másolás
IDS_SELECT_ALL=Select all
IDS_CHECK=Kiválaszott kijelölése
IDS_UNCHECK=Kiválaszott kijelölésének visszavonása
IDS_ADD=Hozzáadás
IDS_EDIT2=Szerkesztés
IDS_DELETE=Törlés
IDS_EXPORT=Exportálás
IDS_IMPORT=Importálás
IDS_RULE_ALLOWLOOPBACK=Allow loopback connections for all
IDS_HIGHLIGHT_INVALID=A fájl nem található
IDS_HIGHLIGHT_NETWORK=Megosztott hálózati fájl
IDS_HIGHLIGHT_PICO=Pico alkalmazás
IDS_HIGHLIGHT_SIGNED=Aláírt alkalmazás
IDS_HIGHLIGHT_SILENT=Letiltott értesítések
IDS_HIGHLIGHT_SPECIAL=Special rules
IDS_HIGHLIGHT_SYSTEM=Rendszeralkalmazások
IDS_GROUP_TIMER=Timer app
IDS_EDITOR=Szabályszerkesztő
IDS_NAME=Név
IDS_RULE=Szabály
IDS_PORTVERSION=Family (ports only)
IDS_PROTOCOL=Protokoll
IDS_DIRECTION=Irány
IDS_ACTION=Művelet
IDS_DATE=Dátum
IDS_FILEPATH=Elérési útvonal
IDS_SIGNATURE=Aláírás
IDS_ADDRESS=Cím
IDS_FILTER=Szűrő
IDS_NOTES=Megjegyzések
IDS_ADDED=Hozzáadva
IDS_TIMELEFT=Time left
IDS_SIGN_SIGNED=Aláírva
IDS_SIGN_UNSIGNED=Nincs aláírva
IDS_GROUP_ALLOWED=Engedélyezett alkalmazások
IDS_GROUP_BLOCKED=Blokkolt alkalmazások
IDS_GROUP_ENABLED=Enabled rules
IDS_GROUP_DISABLED=Letiltott szabályok
IDS_DIRECTION_1=Kimenő
IDS_DIRECTION_2=Bejövő
IDS_DIRECTION_3=Mindkettő
IDS_ACTION_ALLOW=Engedélyezés
IDS_ACTION_BLOCK=Blokkolás
IDS_ENABLE_CHK=Enable rule
IDS_WIKI=Help
IDS_SAVE=Mentés
IDS_CLOSE=Bezárás
IDS_SETTINGS_GENERAL=General
IDS_TITLE_GENERAL=Általános konfiguráció
IDS_TITLE_LANGUAGE=Nyelv
IDS_TITLE_CONFIRMATIONS=Jóváhagyás
IDS_TITLE_INTERFACE=Interface
IDS_TITLE_HIGHLIGHTING=Kiemelés
IDS_TITLE_LOGGING=Log to file
IDS_TITLE_NOTIFICATIONS=Értesítések
IDS_TITLE_ADVANCED=Advanced
IDS_ALWAYSONTOP_CHK=Mindig látható
IDS_LOADONSTARTUP_CHK=Betöltés a rendszer indításakor
IDS_STARTMINIMIZED_CHK=Start minimized
IDS_SHOWFILENAMESONLY_CHK=Csak fájlnevek megjelenítése
IDS_AUTOSIZECOLUMNS_CHK=Oszlopok automatikus méretezése
IDS_SKIPUACWARNING_CHK=A "Felhasználói fiókok felügyelete" figyelmeztetés kihagyása
IDS_CHECKUPDATES_CHK=Frissítések rendszeres ellenőrzése (ajánlott)
IDS_LANGUAGE_HINT=Válasszon nyelvet:
IDS_USESTEALTHMODE_CHK=Rejtett mód engedélyezése
IDS_USESTEALTHMODE_HINT=A port beolvasás megakadályozása a beérkező TCP RST és a kimenő ICMP "Cél elérhetetlen" kérelmek blokkolásával.
IDS_INSTALLBOOTTIMEFILTERS_CHK=Rendszertöltési szűrők telepítése
IDS_INSTALLBOOTTIMEFILTERS_HINT=Az adatszivárgás megakadályozása a rendszer indításakor, még az "Alap szűrőprogram" (BFE) szolgáltatás indítása előtt.
IDS_USECERTIFICATES_CHK=Check apps for digital signatures
IDS_USENETWORKRESOLUTION_CHK=Resolve network addresses
IDS_DISABLEWINDOWSFIREWALL_CHK=Windows tűzfal letiltása
IDS_ENABLEWINDOWSFIREWALL_CHK=Windows tűzfal engedélyezése
IDS_CONFIRMEXIT_CHK=Megerősítést kérő ablak megjelenítése kilépéskor
IDS_CONFIRMEXITTIMER_CHK=Show confirmation dialog on exit when timers are active
IDS_CONFIRMLOGCLEAR_CHK=Megerősítés kérése a naplók törlésekor
IDS_COLORS_HINT=Double-click an item to change it.
IDS_ENABLELOG_CHK=A kihagyott csomagok naplózásának engedélyezése egy fájlba
IDS_LOGSHOW=Napló megjelenítése
IDS_LOGCLEAR=Napló törlése
IDS_LOGSIZELIMIT_HINT=Maximális naplóméret: (kB)
IDS_ENABLENOTIFICATIONS_CHK=Kihagyott csomag értesítések engedélyezése
IDS_NOTIFICATIONSOUND_CHK=Enable notifications sound
IDS_NOTIFICATIONTIMEOUT_HINT=Azonos értesítések közötti időkorlát (mp):
IDS_NOTIFY_TOOLTIP=Create a special rule to allow access to address and/or port for this application.
IDS_QUESTION=Biztos benne?
IDS_QUESTION_DELETE=Valóban törölni szeretné a (z) elemet?
IDS_QUESTION_START=Ez megtiltja a hálózathoz való hozzáférést az ennek megfelelően kiválasztott konfigurációjú alkalmazások esetében! Folytatni szeretné?
IDS_QUESTION_STOP=Ez visszaállítja az összes blokkolt alkalmazás hálózati hozzáférését! Folytatja?
IDS_QUESTION_EXIT=Installed filters will work even if you exit, continue?
IDS_QUESTION_TIMER=Timer activated. Timer are working only when application is running, exit?
IDS_QUESTION_TIMERS=Delete all timer(s)?
IDS_QUESTION_FLAG_CHK=Do not ask again
IDS_STATUS_EMPTY=Empty.
IDS_STATUS_SYNTAX_ERROR=Szintaktikai hiba a(z) szabályban!
IDS_ADDRESS_LOCAL=Source
IDS_ADDRESS_REMOTE=Destination
IDS_UPDATE_ERROR=Update server connection error.
IDS_UPDATE_DOWNLOAD=Downloading update...
IDS_UPDATE_DONE=Downloading update finished.
IDS_GROUP_SPECIAL_APPS=Special rules apps
IDS_RULE_ALLOWLOOPBACK_HINT=This allows all loopback traffic.
IDS_RESET=Reset
IDS_EXCLUDESTEALTH_CHK=port scanner connections
IDS_EXCLUDEBLOCKLIST_CHK=blocklist
IDS_UPDATE_INIT=Checking for new releases...
IDS_UPDATE_INSTALL=Update available, do you want to install them?
IDS_EXCLUDECUSTOM_CHK=user rules
IDS_EXCLUDECLASSIFYALLOW_CHK=allowed connections
IDS_STATUS_TIMER_DONE=Timer for application has been expired
IDS_ICONSEXTRALARGE=Extra large
IDS_STATUS_UNUSED_APPS=Unused apps
IDS_STATUS_TIMER_APPS=Timer apps
IDS_SECUREFILTERS_CHK=Enable protection of installed filters
IDS_SECUREFILTERS_HINT=Prevent unauthorized applications from accessing the installed filters.
IDS_USEREFRESHDEVICES_CHK=Refresh filters when devices are connected
IDS_RULE_ALLOW6TO4=Allow IPv6 redirections (6to4) for all
IDS_RECOMMENDED=recommended
IDS_ICONSISTABLEVIEW=Show as table
IDS_ACTION_ALLOW_HINT=Allow network access forever
IDS_ACTION_BLOCK_HINT=Block network access forever ('til kingdom come)
IDS_ACTION_LATER_HINT=Ignore and ask me later
IDS_RULE_APPLY_2=Apply "%s" for app
IDS_EDITRULES=Edit rules
IDS_TAB_APPS=Apps
IDS_TAB_SERVICES=Services
IDS_TAB_PACKAGES=UWP apps
IDS_TAB_NETWORK=Connections
IDS_STATE=State
IDS_STATUS_FILTERS_ACTIVE=Filters are enabled.
IDS_STATUS_FILTERS_INACTIVE=Filters are disabled!
IDS_STATUS_FILTERS_PROCESSING=Applying filters
IDS_HIGHLIGHT_CONNECTION=Have network connections
IDS_SHOWINLIST=Show in list
IDS_BLOCKLIST_SPY=Microsoft spying and telemetry servers
IDS_BLOCKLIST_UPDATE=Microsoft update servers
IDS_BLOCKLIST_EXTRA=Microsoft applications servers
IDS_PORT=Port
IDS_NOTIFY_TITLE=Network alert
IDS_NOTIFY_HEADER=Network connection was blocked
IDS_DISABLE=Disable
IDS_TITLE_SECURITY=Security
IDS_LOGVIEWER_HINT=Log viewer app
IDS_NOTIFICATIONONTRAY_CHK=Show notification window on tray
IDS_NETWORK_CLOSE=Close connection
IDS_RULE_BLOCKOUTBOUND=Block outbound connections for all
IDS_RULE_BLOCKINBOUND=Block inbound connections for all
IDS_VIEW_ICON=Icons
IDS_VIEW_DETAILS=Details
IDS_VIEW_TILE=Tiles
IDS_RULE_HINT=If you leave fields blank, then rule will be applied for any address and port.
IDS_RULE_APPS_HINT=If there is no apps selected, then rule will be applied for all apps.
IDS_STATUS_FILTERS_ACTIVE_TEMP=Filters are enabled until reboot.
IDS_INSTALL_PERMANENT=Permanent rules. Rules are working until you disable it manually.
IDS_INSTALL_TEMPORARY=Temporary rules. Rules are reset after the next reboot.
IDS_ENABLEUILOG_CHK=Enable packets logging interface
IDS_NOTIFICATIONFULLSCREENSILENTMODE_CHK=Enable silent-mode when full screen app in foreground
IDS_TITLE_TRAY=Tray icon
IDS_TRAYICONSINGLECLICK_CHK=Single click on tray icon to open
IDS_ENABLE_APP_CHK=Enable network access
IDS_APP_HINT=There is no reason to set any permissive rule for app with already enabled internet access.
IDS_HOST=Host
IDS_CONFIRMALLOW_CHK=Confirm when allowing application
IDS_QUESTION_ALLOW=Are you sure you want to enable full internet access for this application?
IDS_SHOWSEARCHBAR_CHK=Show search bar
IDS_LAYER=Layer
IDS_RULE_ALLOWWINDOWSUPDATE=Allow Windows Update
IDS_ACTION_TERMINATE_HINT=Terminate process
IDS_PROFILE_TYPE=Profile type
IDS_USEAPPMONITOR_CHK=Monitor apps changing
IDS_DISABLEREMOVAL=Disable removal
IDS_USEHASHES_CHK=Check apps for sha-256 hash
IDS_COMMENT=Comments
IDS_USEDARKTHEME=Use dark theme
IDS_KEEPUNUSED_CHK=Keep unused apps
IDS_UPDATE_NO=Nincs elérhető frissítés.
IDS_UPDATE_YES=Update available. Download and install now?
IDS_UPDATE_SPEED=Speed
IDS_RULE_FOR_ALL=for all
IDS_RULE_FOR_APPS=for apps
IDS_PROFILE_TYPE_PLAIN=Plain
IDS_PROFILE_TYPE_COMPRESSED=Compressed
IDS_PROFILE_TYPE_ENCRYPTED=Encrypted
IDS_SESSION_ONLY=session only
IDS_LIMIT_REACHED=Limit reached.
IDS_INTERNAL_RULE=Internal rule
IDS_LOADING=Loading...
IDS_DIRECTION_REMOTE=Remote
IDS_DIRECTION_LOCAL=Local
IDS_WARNING_UNEXPECTED=Be careful, through service/driver host (svchost.exe/System) internet traffic can let out through unexpected ways. Continue?
IDS_WARNING_ME=If you disallow main process, you cannot use resolve network addresses option. Continue?
IDS_TOTAL=Total
IDS_EXCLUDEINBOUND_CHK=inbound multicast/broadcast
IDS_CONNECTIONS_ENABLE=Enable connections monitoring
IDS_CONNECTIONS_SHOWAITCONNECTIONS=Show waiting connections
IDS_CONNECTIONS_MEAUSUREUDPTRAFFIC=Measure UDP/QUIC traffic (experimental, restart required)
IDS_UDP_ACCOUNTING=UDP (including QUIC): ETW bytes since this socket was first monitored.
IDS_UDP_UNAVAILABLE=UDP measurement unavailable or incomplete. Restart simplewall to retry. Error
IDS_UDP_PENDING=UDP: no verified measurement yet. Sockets opened before monitoring must be reopened.
